In [4]:
import pandas as pd
col_names=['sl_no','age','gender','role','id']
data=pd.read_table("/home/ila/PycharmProjects/pythonworks/artificialintelligence/pandas/files/ex.txt",sep="|",names=col_names)
data.dtypes

/home/ila/anaconda3/envs/featurebranch/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until

sl_no      int64
age        int64
gender    object
role      object
id        object
dtype: object

In [6]:
data.head()

   sl_no  age gender        role     id
0      1   24      M  technician  85711
1      2   53      F       other  94043
2      3   23      M      writer  32067
3      4   24      M  technician  43537
4      5   33      F       other  15213

In [8]:
data.age= data.age.astype(float)
data.head()

   sl_no   age gender        role     id
0      1  24.0      M  technician  85711
1      2  53.0      F       other  94043
2      3  23.0      M      writer  32067
3      4  24.0      M  technician  43537
4      5  33.0      F       other  15213

#### Data type can be specified while loading data

#### id is object(string) so replacing any non digit with 3 and converting to float

In [41]:
data1= pd.read_table("/home/ila/PycharmProjects/pythonworks/artificialintelligence/pandas/files/ex.txt", sep='|', names= col_names, dtype={'age':float, 'sl_no':float})
data1.head()

/home/ila/anaconda3/envs/featurebranch/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   sl_no   age gender        role     id
0    1.0  24.0      M  technician  85711
1    2.0  53.0      F       other  94043
2    3.0  23.0      M      writer  32067
3    4.0  24.0      M  technician  43537
4    5.0  33.0      F       other  15213

In [42]:
# data.id= data.id.str.replace('\D','3')
data.id.head()

0    33333
1    33333
2    33333
3    33333
4    33333
Name: id, dtype: object

In [44]:
data.id= data.id.astype(float)
data.dtypes

sl_no       int64
age       float64
gender     object
role       object
id        float64
dtype: object